; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-4-14)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p0-6 - location
	p1-2 - location
	p2-0 - location
	p2-6 - location
	p2-7 - location
	p4-3 - location
	p4-7 - location
	p5-2 - location
	p5-4 - location
	p6-1 - location
	p6-4 - location
	p7-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s1)
	(at driver3 s5)
	(at driver4 s7)
	(at truck1 s3)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s7)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s7)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s4)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s7)
	(at package2 s3)
	(at package3 s7)
	(at package4 s3)
	(at package5 s3)
	(at package6 s3)
	(at package7 s5)
	(at package8 s2)
	(at package9 s2)
	(at package10 s5)
	(at package11 s6)
	(at package12 s4)
	(at package13 s0)
	(at package14 s3)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 96)
	(= (time-to-drive s2 s0) 96)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 62)
	(= (time-to-drive s3 s0) 62)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 82)
	(= (time-to-drive s0 s1) 82)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 98)
	(= (time-to-drive s5 s1) 98)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 87)
	(= (time-to-drive s6 s1) 87)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 78)
	(= (time-to-drive s3 s2) 78)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 45)
	(= (time-to-drive s6 s2) 45)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 71)
	(= (time-to-drive s1 s3) 71)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 77)
	(= (time-to-drive s5 s3) 77)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 40)
	(= (time-to-drive s6 s3) 40)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 8)
	(= (time-to-drive s0 s4) 8)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 92)
	(= (time-to-drive s3 s4) 92)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 7)
	(= (time-to-drive s7 s4) 7)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 37)
	(= (time-to-drive s2 s5) 37)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 7)
	(= (time-to-drive s4 s5) 7)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 99)
	(= (time-to-drive s7 s5) 99)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 54)
	(= (time-to-drive s0 s6) 54)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 96)
	(= (time-to-drive s5 s6) 96)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 24)
	(= (time-to-drive s1 s7) 24)
	(link s7 s2)
	(link s2 s7)
	(= (time-to-drive s7 s2) 50)
	(= (time-to-drive s2 s7) 50)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s7)
	(at truck1 s6)
	(at truck3 s3)
	(at package1 s4)
	(at package2 s2)
	(at package3 s4)
	(at package4 s6)
	(at package6 s4)
	(at package7 s7)
	(at package8 s7)
	(at package9 s6)
	(at package10 s2)
	(at package11 s2)
	(at package12 s5)
	(at package13 s4)
	(at package14 s0)
	))

(:metric minimize (+ (* 1 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver4 truck3 s7)
   deleted: (at driver4 s7) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 0 of 16
2. (load-truck package3 truck3 s7)
   deleted: (at package3 s7)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 0 of 16
3. (drive-truck truck3 s7 s2 driver4)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   changed: (fuel-used) from 0 to 550
   goals met: 0 of 16
4. (load-truck package8 truck3 s2)
   deleted: (at package8 s2)
   added: (in package8 truck3)
   changed: (load truck3) from 1 to 2, (fuel-per-minute truck3) from 11 to 13
   goals met: 0 of 16
5. (load-truck package9 truck3 s2)
   deleted: (at package9 s2)
   added: (in package9 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 0 of 16
6. (walk driver1 s2 p2-7)
   deleted: (at driver1 s2)
   added: (at driver1 p2-7)
   goals met: 0 of 16
7. (drive-truck truck3 s2 s6 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   changed: (fuel-used) from 550 to 1270
   goals met: 0 of 16
8. (unload-truck package9 truck3 s6)
   deleted: (in package9 truck3)
   added: (at package9 s6)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 1 of 16
9. (load-truck package11 truck3 s6)
   deleted: (at package11 s6)
   added: (in package11 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 1 of 16
10. (drive-truck truck3 s6 s2 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s2)
   changed: (fuel-used) from 1270 to 1990
   goals met: 1 of 16
11. (unload-truck package11 truck3 s2)
   deleted: (in package11 truck3)
   added: (at package11 s2)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 2 of 16
12. (drive-truck truck3 s2 s3 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   changed: (fuel-used) from 1990 to 3004
   goals met: 3 of 16
13. (load-truck package2 truck3 s3)
   deleted: (at package2 s3)
   added: (in package2 truck3)
   changed: (load truck3) from 2 to 3, (fuel-per-minute truck3) from 13 to 16
   goals met: 3 of 16
14. (load-truck package4 truck3 s3)
   deleted: (at package4 s3)
   added: (in package4 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 3 of 16
15. (load-truck package6 truck3 s3)
   deleted: (at package6 s3)
   added: (in package6 truck3)
   changed: (load truck3) from 4 to 5, (fuel-per-minute truck3) from 20 to 25
   goals met: 3 of 16
16. (load-truck package14 truck3 s3)
   deleted: (at package14 s3)
   added: (in package14 truck3)
   changed: (load truck3) from 5 to 6, (fuel-per-minute truck3) from 25 to 31
   goals met: 3 of 16
17. (drive-truck truck3 s3 s2 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   changed: (fuel-used) from 3004 to 5422
   goals met: 2 of 16
18. (unload-truck package2 truck3 s2)
   deleted: (in package2 truck3)
   added: (at package2 s2)
   changed: (load truck3) from 6 to 5, (fuel-per-minute truck3) from 31 to 25
   goals met: 3 of 16
19. (drive-truck truck3 s2 s5 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   changed: (fuel-used) from 5422 to 6347
   goals met: 3 of 16
20. (load-truck package7 truck3 s5)
   deleted: (at package7 s5)
   added: (in package7 truck3)
   changed: (load truck3) from 5 to 6, (fuel-per-minute truck3) from 25 to 31
   goals met: 3 of 16
21. (load-truck package10 truck3 s5)
   deleted: (at package10 s5)
   added: (in package10 truck3)
   changed: (load truck3) from 6 to 7, (fuel-per-minute truck3) from 31 to 38
   goals met: 3 of 16
22. (drive-truck truck3 s5 s4 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 6347 to 6613
   goals met: 3 of 16
23. (unload-truck package3 truck3 s4)
   deleted: (in package3 truck3)
   added: (at package3 s4)
   changed: (load truck3) from 7 to 6, (fuel-per-minute truck3) from 38 to 31
   goals met: 4 of 16
24. (unload-truck package6 truck3 s4)
   deleted: (in package6 truck3)
   added: (at package6 s4)
   changed: (load truck3) from 6 to 5, (fuel-per-minute truck3) from 31 to 25
   goals met: 5 of 16
25. (load-truck package12 truck3 s4)
   deleted: (at package12 s4)
   added: (in package12 truck3)
   changed: (load truck3) from 5 to 6, (fuel-per-minute truck3) from 25 to 31
   goals met: 5 of 16
26. (drive-truck truck3 s4 s5 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 6613 to 6830
   goals met: 5 of 16
27. (walk driver1 p2-7 s7)
   deleted: (at driver1 p2-7)
   added: (at driver1 s7)
   goals met: 6 of 16
28. (unload-truck package12 truck3 s5)
   deleted: (in package12 truck3)
   added: (at package12 s5)
   changed: (load truck3) from 6 to 5, (fuel-per-minute truck3) from 31 to 25
   goals met: 7 of 16
29. (drive-truck truck3 s5 s2 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (fuel-used) from 6830 to 7755
   goals met: 7 of 16
30. (load-truck package1 truck2 s7)
   deleted: (at package1 s7)
   added: (in package1 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 7 of 16
31. (unload-truck package10 truck3 s2)
   deleted: (in package10 truck3)
   added: (at package10 s2)
   changed: (load truck3) from 5 to 4, (fuel-per-minute truck3) from 25 to 20
   goals met: 8 of 16
32. (drive-truck truck3 s2 s0 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (fuel-used) from 7755 to 9675
   goals met: 8 of 16
33. (unload-truck package14 truck3 s0)
   deleted: (in package14 truck3)
   added: (at package14 s0)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 9 of 16
34. (load-truck package13 truck3 s0)
   deleted: (at package13 s0)
   added: (in package13 truck3)
   changed: (load truck3) from 3 to 4, (fuel-per-minute truck3) from 16 to 20
   goals met: 9 of 16
35. (drive-truck truck3 s0 s4 driver4)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   changed: (fuel-used) from 9675 to 9835
   goals met: 9 of 16
36. (unload-truck package13 truck3 s4)
   deleted: (in package13 truck3)
   added: (at package13 s4)
   changed: (load truck3) from 4 to 3, (fuel-per-minute truck3) from 20 to 16
   goals met: 10 of 16
37. (drive-truck truck3 s4 s3 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   changed: (fuel-used) from 9835 to 11307
   goals met: 11 of 16
38. (drive-truck truck3 s3 s6 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (fuel-used) from 11307 to 11947
   goals met: 10 of 16
39. (unload-truck package4 truck3 s6)
   deleted: (in package4 truck3)
   added: (at package4 s6)
   changed: (load truck3) from 3 to 2, (fuel-per-minute truck3) from 16 to 13
   goals met: 11 of 16
40. (drive-truck truck3 s6 s5 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s5)
   changed: (fuel-used) from 11947 to 13195
   goals met: 11 of 16
41. (board-truck driver1 truck2 s7)
   deleted: (at driver1 s7) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 10 of 16
42. (drive-truck truck2 s7 s4 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s4)
   changed: (fuel-used) from 13195 to 13272
   goals met: 10 of 16
43. (unload-truck package1 truck2 s4)
   deleted: (in package1 truck2)
   added: (at package1 s4)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 11 of 16
44. (drive-truck truck2 s4 s7 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s7)
   changed: (fuel-used) from 13272 to 13342
   goals met: 11 of 16
45. (disembark-truck driver1 truck2 s7)
   deleted: (driving driver1 truck2)
   added: (at driver1 s7) (empty truck2)
   goals met: 12 of 16
46. (drive-truck truck3 s5 s7 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   changed: (fuel-used) from 13342 to 14629
   goals met: 12 of 16
47. (unload-truck package7 truck3 s7)
   deleted: (in package7 truck3)
   added: (at package7 s7)
   changed: (load truck3) from 2 to 1, (fuel-per-minute truck3) from 13 to 11
   goals met: 13 of 16
48. (unload-truck package8 truck3 s7)
   deleted: (in package8 truck3)
   added: (at package8 s7)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 14 of 16
49. (drive-truck truck3 s7 s5 driver4)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (fuel-used) from 14629 to 15619
   goals met: 14 of 16
50. (drive-truck truck3 s5 s3 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (fuel-used) from 15619 to 16389
   goals met: 15 of 16
51. (disembark-truck driver4 truck3 s3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s3) (empty truck3)
   goals met: 15 of 16
52. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 15 of 16
53. (drive-truck truck1 s3 s6 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   changed: (fuel-used) from 16389 to 16789
   goals met: 16 of 16
